{
  "prayers": [
    {
      "id": "takbiratul-ihram",
      "title": "Takbiratul Ihram",
      "category": "opening",
      "arabic": "اللَّهُ أَكْبَرُ",
      "transliteration": "Allahu akbar",
      "translation": "Allah Maha Besar"
    },
    {
      "id": "doa-iftitah",
      "title": "Doa Iftitah",
      "category": "opening",
      "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرُكَ",
      "transliteration": "Subhanakallahumma wabihamdika watabarokasmuka wata'ala jadduka wala ilaha ghairuka",
      "translation": "Maha Suci Engkau ya Allah, dengan memuji-Mu, dan berkah nama-Mu, dan tinggi keagungan-Mu, dan tidak ada Tuhan selain Engkau"
    },
    {
      "id": "al-fatihah",
      "title": "Al-Fatihah",
      "category": "recitation",
      "arabic": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ۝ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ۝ الرَّحْمَنِ الرَّحِيمِ ۝ مَالِكِ يَوْمِ الدِّينِ ۝ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ۝ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ۝ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
      "transliteration": "Bismillahir rahmanir rahiim. Alhamdulillahi rabbil 'alamiin. Ar rahmanir rahiim. Maliki yaumiddiin. Iyyaka na'budu wa iyyaka nasta'iin. Ihdinash shiratal mustaqiim. Shiratalladzina an'amta 'alaihim ghairil maghdhuubi 'alaihim waladh dhalliin",
      "translation": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang. Segala puji bagi Allah, Tuhan seluruh alam. Yang Maha Pengasih, Maha Penyayang. Pemilik hari pembalasan. Hanya kepada Engkaulah kami menyembah dan hanya kepada Engkaulah kami mohon pertolongan. Tunjukilah kami jalan yang lurus. Yaitu jalan orang-orang yang telah Engkau beri nikmat kepadanya; bukan jalan mereka yang dimurkai, dan bukan pula jalan mereka yang sesat"
    },
    {
      "id": "ruku",
      "title": "Doa Ruku'",
      "category": "movement",
      "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ وَبِحَمْدِهِ",
      "transliteration": "Subhana rabbiyal 'azhiimi wabihamdih",
      "translation": "Maha Suci Tuhanku Yang Maha Agung, dengan memuji-Nya"
    },
    {
      "id": "iktidal",
      "title": "I'tidal",
      "category": "movement",
      "arabic": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ",
      "transliteration": "Sami'allahu liman hamidah, rabbana walakal hamdu",
      "translation": "Allah mendengar orang yang memuji-Nya, ya Tuhan kami, bagi-Mu segala puji"
    },
    {
      "id": "sujud",
      "title": "Doa Sujud",
      "category": "movement",
      "arabic": "سُبْحَانَ رَبِّيَ الْأَعْلَى وَبِحَمْدِهِ",
      "transliteration": "Subhana rabbiyal a'la wabihamdih",
      "translation": "Maha Suci Tuhanku Yang Maha Tinggi, dengan memuji-Nya"
    },
    {
      "id": "tahiyyat-awal",
      "title": "Tahiyyat Awal",
      "category": "sitting",
      "arabic": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ",
      "transliteration": "Attahiyyatu lillahi wash shalawatu wath thayyibatu. Assalamu 'alaika ayyuhan nabiyyu wa rahmatullahi wa barakatuh. Assalamu 'alaina wa 'ala 'ibadillahish shalihin. Asyhadu alla ilaha illallahu wa asyhadu anna Muhammadan rasulullah",
      "translation": "Segala penghormatan, keberkahan, dan kebaikan hanya bagi Allah. Semoga keselamatan, rahmat Allah, dan berkah-Nya tercurah kepadamu wahai Nabi. Semoga keselamatan tercurah kepada kami dan hamba-hamba Allah yang shaleh. Aku bersaksi bahwa tidak ada Tuhan selain Allah, dan aku bersaksi bahwa Muhammad adalah utusan Allah"
    },
    {
      "id": "tahiyyat-akhir",
      "title": "Tahiyyat Akhir",
      "category": "sitting",
      "arabic": "التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
      "transliteration": "Attahiyyatu lillahi wash shalawatu wath thayyibatu. Assalamu 'alaika ayyuhan nabiyyu wa rahmatullahi wa barakatuh. Assalamu 'alaina wa 'ala 'ibadillahish shalihin. Asyhadu alla ilaha illallahu wa asyhadu anna Muhammadan rasulullah. Allahumma shalli 'ala Muhammad wa 'ala ali Muhammad kama shallaita 'ala Ibrahim wa 'ala ali Ibrahim innaka hamidum majid. Allahumma barik 'ala Muhammad wa 'ala ali Muhammad kama barakta 'ala Ibrahim wa 'ala ali Ibrahim innaka hamidum majid",
      "translation": "Segala penghormatan, keberkahan, dan kebaikan hanya bagi Allah. Semoga keselamatan, rahmat Allah, dan berkah-Nya tercurah kepadamu wahai Nabi. Semoga keselamatan tercurah kepada kami dan hamba-hamba Allah yang shaleh. Aku bersaksi bahwa tidak ada Tuhan selain Allah, dan aku bersaksi bahwa Muhammad adalah utusan Allah. Ya Allah, limpahkanlah shalawat kepada Muhammad dan keluarga Muhammad sebagaimana Engkau telah melimpahkan shalawat kepada Ibrahim dan keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji lagi Maha Mulia. Ya Allah, limpahkanlah berkah kepada Muhammad dan keluarga Muhammad sebagaimana Engkau telah melimpahkan berkah kepada Ibrahim dan keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji lagi Maha Mulia"
    },
    {
      "id": "salam",
      "title": "Salam",
      "category": "closing",
      "arabic": "السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ",
      "transliteration": "Assalamu 'alaikum wa rahmatullah",
      "translation": "Semoga keselamatan dan rahmat Allah tercurah kepada kalian"
    }
  ]
}
